// 数据文件：wordsData（从 script.js 拆分，自动生成）
const wordsData = [
    {
      date: '2026.08.11',
      title: '总选后碎碎念',
      content: `111这里有话说

说实话这两天我一直在调节自己的情绪，和自己的所有和解，我也知道大家在默默陪伴我担忧我。

今年我们厉害吗，毋庸置疑，我们就是很厉害，我们一点一点用时间用努力堆起来了这个45的名次，熬了几乎一整个夏天的夜，我很感谢你们一直陪着我支持我选择我，让我每时每刻都不是一个人，让我感觉从未被放弃。

你们对我来说是无比珍贵的礼物，是我想要用尽全力去守护去爱护的存在，我想看你们因为我而露出微笑，想要你们因为我获得一些动力去面对未知的挑战。

值得吗，有你们就值得！我常说有个好结果多辛苦都值得，但真到了结果不如意的时候就不值得了吗，也值得，我全力以赴就值得。

我经常告诉自己努力不一定有回报，但不努力肯定没有，这也是我可以快速调整好自己的方式的一种。

难过吗，也难过，我难过的要死，得到结果的那一刻我无法接受，我脑袋里的那根弦一下就断了，整个脑袋都在嗡嗡作响，想要微笑但微笑不出来，背在脑海里的词全都化为了一腔不甘。

我是一个认定一件事就很固执的人，我既然获得了站上舞台的机会，那我必然不会辜负不会轻易放弃，在这里有且只有一件已经认定的目标。

我很早就说过我没办法接受今年的自己比去年差，也许没人记得，但我说出口的话都是我深思熟虑后的，我知道这不应该用名次去定义，但在这里名次是最直接，是证明一整年的努力被看见的结晶，我就是想要在这短暂而又漫长的两个月转化成实质性的结果。

我也明白这个结果不单单只是一个名次，是大家对我的认可和肯定，我非常渴望得到认可，这可以让我有更多的底气去选择自己想要做的事情，让我接触从未接触过的事物，让我变得更好，让我可以更自信更坚定的走接下来的路，有了支撑才能更有动力的前进。

其实后退带给我的挫败也让我一直在质疑自己，我知道没有谁一定有义务要支持我给我投票，我所收到的全来自大家最诚挚的爱。

爱很伟大可以建立起两个陌生人之间的羁绊，爱也促使着我想成为更好的自己回应你们。

未知的明天。

等以后某一个瞬间想起来会觉得，喜欢叶凡真是最幸福的事情了，那这一刻，就是我所有努力的具象化。

当然我也有颓废的时候，这个时候我会觉得这个世界都对我很差，努力就会被看到吗，就算我付出了时间和精力去做自己想做的事，那也不会如愿得到我想要的结果，又有什么意义呢，我会想就这样吧，反正也不会怎样，也不会有人在意，可能转身我就会被别人替代，现实好残酷吧对不对……

我不甘又能改变什么呢，我是渺小的，渺小的我真的能做到我想要的样子吗，我不是那么好，我也不那么完美甚至很脆弱和敏感，还要面子不想让大家看到我流眼泪，只要眼泪不流下来那我就没哭，强撑着坚强好累，让自己懂事也好累，有熬不完的夜也好累，想到没做到自己想做到的也好累，说话也好累，时常想要不就放弃吧。

但放弃更难更需要勇气，我没办法丢下那个带着不甘对未来向往的自己和一直默默守护我挂念我的人。

你们的存在给了我不放弃自己的理由，因为你们对我很重要，当我这样告诉自己我就立马充满了做所有事的动力。

我不是一只没有感情的电子蝴蝶，我珍惜所拥有的一切，请不要否定自己也不要否定我，陪着我坚定的选择我好吗，渺小的我有因你而勇敢的梦。

我写那么多可能更多是想告诉现在的自己，难受不如接受现状继续前进，目标本就是用来奔赴的。

也想告诉每一个关心我的你，对我的每一份支持都是支撑我走下去的动力。

在名次上输了，但从某方面来说，勇敢的人本就立于不败之地，因为勇者从不会因为挫折而气馁，勇敢是当你还未开始无论如何都要把它坚持到底，你很少能赢，但有时也会。

45名可以是起点，但绝对不是终点。`
    },
    {
      date: '2026.07.12',
      title: '26年青春宣言发言',
      content: `没想到我先讲话吧对不对？因为一会儿跳的话，我肯定会出汗，然后又一直喘气，我觉得可能会影响大家听我讲话，加上有的时候我会说话有点不清晰。好的，我要开始了。

大家好，我是SNH48 TeamNII的叶凡。

其实最开始喜欢上舞台没有多么盛大的理由，只是偶然看到屏幕里前辈们站在舞台上闪闪发光的样子。那一刻我心里突然有了一个很清晰的向往。那时候的我很稚嫩也很胆怯，只会对着视频一遍一遍笨拙地跟跳，把喜欢藏在一次次默默的练习里。我一直都记得在一次和朋友散步回家，在公园随意跳着自己练的舞，意外得到了朋友的一句肯定，就是那句夸奖也给了我很大的勇气，让我第一次萌生了我也想站在舞台上试一试的念头。

下定决心之后，我开始为了通过初试一遍遍地练习舞蹈，对着镜子练习，在不同的地方回忆动作。我还记得我一开始独自奔赴上海，坐火车面试的心情。当时虽然前路未知，心里忐忑到睡不着觉，但心里那束关于舞台的光一直支撑着我坚持到了初试结束。对，很幸运我的勇敢没有被辜负，我成功地踏入了这里，拥有了属于自己追逐舞台的机会。刚入团的我依旧不够自信，为了第一次登台拼尽全力地练习，真正站在出道舞台16号位的时候，我紧张到手足无措。

第一次面对镜头的时候也是懵懂又局促，我有多紧张，我的眼睛就眨得有多快，所以有的时候我的眼睛就会出卖我紧张的心情。所以在后来的日子里，我从来不放过任何一次成长的机会，我会多多的接助演，并且珍惜每次登台的机会，在不同的舞台不同的风格里不断的打磨自己，让关注着我的每一个人都看到了从一开始很笨拙到现在站在舞台上越来越坦然面对每一个舞台的我，我努力地成就了现在的我。但我也知道走到今天我从来都不是一个人在前行。如果说最初支持着我出发的是一腔热爱，那一路陪我走到现在的就是身后无数份对我的支持和喜欢。练习确实很累，舞台不管什么情况，我坦然面对，但我也有紧张的时候，是你们的陪伴给了我坚持下去的理由，给了我没有那么害怕、那么紧张的理由。我很清我清楚知道自己现在也有很多成长的空间，可正是你们愿意包容我的稚嫩，相信我的成长，才让我敢一次次挑战新的舞台。前路有风也有浪，但因为有你们的陪伴，我便永远有奔赴光亮、挑战未知的勇气。我觉得舞台从来都不是一蹴而就的光芒，而是日复一日的热爱与坚持。

未来我也会继续带着我的赤诚和勇敢，继续脚踏实地的练习，认认真真地对待每一次舞台，不辜负自己的热爱，也不辜负每一份给我的陪伴还有支持。我会继续努力，成为更耀眼更坚定的自己，谢谢每一个陪伴着我的你们。未来的路还很长，我的成长也永不停止。舞台教会我的从来都不是光芒，而是哪怕渺小也要频频发光，哪怕平凡也要全力以赴。所以我在这里想大声喊出我今年的目标，我今年的目标是第20名，然后也希望拿到队内前三的位置，谢谢大家。`
    },
    {
      date: '2025.06.02',
      title: '25年青春宣言发言（不完整版）',
      content: `好的，结束了，看看的还开心吗？谢谢大家。好的，我就先开始念我的这个发言吧。

hello大家好，我是SNH48 Team NII的叶凡。

欢迎大家来看今天的我的生日公演还有青春展演。不知不觉已经来到属于我们的第二次青春展演了，时间过得真的好快，今年我最大的感触就是感谢遇见，对，遇见这么好的你们，然后你们选择了我。然后呢，我选择了不问将来这首歌作为我的展演作品，因为我觉得无论过因为我最近很喜欢一句话，就是无论过去，因为我们不能改变过去不问将来，因为将来一定会因为我们而改变。

感觉去年紧张的画面还历历在目，虽然今天也是很让我紧张的一天，不过我觉得真的很尽兴。因为在同样的六月，站在同样的舞台，不同的是比去年成长了许多的我，还有多了更多坐在观众席为我而来的大家和屏幕面前默默支持着我的你们。去年我说过，我希望对你们来说，喜欢我是一件很值得很骄傲的事情。今年也依旧如此，以后的每一年也是如此。

其实因为我的名字，我听到很多声音说，如果我可以因为利用叶凡这个名字去一些梗或者之类的，就可以得到至少比现在要多一点的流量。但是这样的调侃，因为我的性格比较内敛，然后还有我觉得我的骄傲也不允许我、我也不想去做这样的事情。我从始至终都希望大家是因为我是我，所以才喜欢我，认识我。虽然我不能说我就是因为你们有人会因为我的名字去关注我的，这样不好，因为我的名字毕竟在这里，但是我还是想努力让大家在提起叶凡的时候，脑海里想的是我。

当然在努力的过程中，放弃的心在不经意间出现过无数次，但无数次都被我否决。我就是不想放弃，我就是要做，别人可以，凭什么我不行？我既然已经站在这里，我就要拼尽全力去做我想做的事情。就算我会的东西没那么多，需要学习的东西很多，可那又怎么样呢？我就是想做，我就是想把我所想变成现实。如果我是一个那么轻易就被打倒的人，那现在站在你们面前的许就不是我了。就算属于我的那份蛋糕，因为摔倒掉在了地上，但是我依旧会倔强的擦掉眼泪，站起来继续向前，下一个转角我会遇到因我而存在的甜品店。我始终相信我可以并值得拥有一切美好的事物，不只是因为我觉得我值得，陪伴在我身边的大家，还有爱我的大家也告诉着我，我值得。我想站在你们更容易看到的地方，我想多多出现在你们的视野中，多多停留在你们的眼这个眼中。

去年大家齐心协力，也是投到了新人第四的成绩。但是今年我想努力去触摸一下那个可以被抓到的奖杯、对我来说有着不同意义的奖杯。所以我今年我想说我的目标就是如果能进到48，就是这是我想说的目标。对。怎么说呢？就是相比于去年那个因为害怕而把自己想法不敢宣之于口的我，今年的我也许多了更多的勇气把我所想说给大家听，但我觉得懂我的你们应该也能猜到我的想法。其实我也害怕说出口德和最后收获的结果并不相同，但我觉得最重要的是这份向上的态度和勇敢面对未来和面对未知的勇气，在你们为我奔赴而来的时候，我会做好万全的准备，扑进你们的怀抱，我们一起一鼓作气，为了同一个目标努力的那份热血是这个夏天的限定，但也是我们的决心。也许我们的光远看很很薄弱，但近看...`
    },
    {
      date: '2024.06.08',
      title: '24年青春宣言发言',
      content: `大家好，我是SNH48 Team NII的叶凡谢谢大家来看我们今天的青春展演~

站在这里表示属于我在这里的第一个夏天正式开始啦。
感觉出道的场景还历历在目，我还记得那时候站在舞台上紧张到说话都颤抖的样子。现在的我是不是好了很多!

因为不想辜负每一个为我而来的人的期待。我希望对你们来说喜欢我是一件很值得开心，很值得骄傲的事。
虽然在这里的时间还不算太长，但这大半年里真真切切的让我学会了很多，成长了很多，也解锁了许多我以前不曾接触过的东西，最重要的是在这个过程中我收获了很多颗喜欢我的星星们。
一直以来想谢谢你们的事情有很多。谢谢你们喜欢我，谢谢你们为我争取的舞台，也谢谢你们成为我继续跳下去的底气，更谢谢你们给予我的支持~常常听你们说喜欢我是一件很幸福的事情~我想说，我也是!被散在世界各地的你们喜欢也是我来到这里之后最幸福的收获，所以我很感谢去年只身一人来到这里的我，也很庆幸自己做了这个决定。对我来说，人生的选择有很多种。我勇敢过了，而我的这份勇敢也得到了回报。现在，我已经站在这里了，以后我也想站上更大的舞台，展示更好的自己。也希望正在抉择的你们可以获得自己想要的未来。

可能我的话听着很满，但却是我的真情实感其实我也是一个偶尔也会感到迷茫，会脆弱，会质疑自己努力真的有用吗，我真的可以吗...来到这里之前我也是一个很普通的人，茫茫人海中一站你们可能会找不到我的身影，更何况我还是一个不太敢表达感情的人。所以每次想对你们表达一些感谢或者喜欢的时候，话到嘴边了又总是会被怯懦的情绪打断，会乱七八糟的思虑很多，想很多，却又闭口不谈，干脆想着就用行动证明吧。
我想证明我是一个有意义的存在，我想去创造属于我的精彩人生，叶凡的凡不是平凡的凡，是不甘平凡(不同凡响、的凡，想以后大家提起叶凡这两个字也能想起我，我愿意付出百分之百的努力去触摸和成为那个我想成为的自己。既然已经开启了这段属于我的旅程，我会全力以赴的做好每一件事情，未来的我还想继续在这里跳给大家看，想继续听大家的声音，想站在你们目所能及的地方，想要你们可以更多的看到我，我的野心也从来不只是说说而已。毕竟，我可是狮子座~也许现在我的实力可能还不足以支撑我的野心，但我要做那个野心与实力相匹配的存在~

现在的我能做到的可能有限，那就用最直接的方式用越来越优秀的我来回馈大家对我的支持和付出吧~毕竟!有你们的喜欢，我就不普通。`
    }
    
  ];
